In [1]:
from os.path import join
from sqlalchemy import create_engine, Column, Integer, String, Float, Date
from sqlalchemy.ext.declarative import declarative_base
import numpy as np
import pandas as pd
from sqlalchemy import create_engine, func, text
from sqlalchemy.orm import sessionmaker
from tqdm import tqdm
class Config:
    DATA_PATH = "/Users/oguz/Desktop/Case study/OguzhanKir"
df = pd.read_csv(join(Config.DATA_PATH, "customer_purchases.csv"))
df["gender"] = df["gender"].map({"Female":1, "Male":0})

In [2]:
for col in df.columns:
    df[col] = df[col].replace(np.nan, None).replace(np.NaN, None)

In [3]:
transaction_table_data = df[["customer_id", "purchase_amount", "purchase_date"]]
customer_table_data = df.drop_duplicates(subset=["customer_id"], keep="last")[["customer_id", "age","gender", "annual_income"]]

In [4]:
DATABASE_URL = "postgresql+psycopg2://postgres:postgres@localhost:5432/postgres"
engine = create_engine(DATABASE_URL)
Session = sessionmaker(bind=engine)
session = Session()

In [5]:
Base = declarative_base()

class Customer(Base):
    __tablename__ = 'customer'
    customer_id = Column(Integer, primary_key=True)
    age = Column(Integer, nullable=True)
    gender = Column(Integer, nullable=True)
    annual_income = Column(Float, nullable=True)

class Transaction(Base):
    __tablename__ = 'transaction'
    id = Column(Integer, primary_key=True, autoincrement=True)
    customer_id = Column(Integer)
    purchase_amount = Column(Float)
    purchase_date = Column(Date)

Base.metadata.drop_all(engine)
Base.metadata.create_all(engine)

for index, row in tqdm(customer_table_data.iterrows()):
    customer = Customer(
        customer_id=row['customer_id'],
        age=row['age'],
        gender=row['gender'],
        annual_income=row['annual_income']
    )
    session.merge(customer) 

for index, row in tqdm(transaction_table_data.iterrows()):
    transaction = Transaction(
        customer_id=row['customer_id'],
        purchase_amount=row['purchase_amount'],
        purchase_date=row['purchase_date']
    )
    session.add(transaction)

session.commit()
session.close()

/var/folders/1r/1k1y3nts0_ldchv192_z9lc80000gn/T/ipykernel_4537/3675618228.py:1: MovedIn20Warning: The ``declarative_base()`` function is now available as sqlalchemy.orm.declarative_base(). (deprecated since: 2.0) (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  Base = declarative_base()
1914it [00:02, 877.17it/s]
9805it [00:00, 23097.97it/s]

In [6]:
pd.read_sql("SELECT * FROM customer", engine)

      customer_id   age  gender  annual_income
0               1  40.0     1.0       119228.0
1               2  64.0     0.0       112085.0
2               3   NaN     1.0        65840.0
3               4  53.0     1.0        98212.0
4               5  36.0     1.0       125619.0
...           ...   ...     ...            ...
1909         1996  32.0     1.0        40388.0
1910         1997  66.0     1.0        35392.0
1911         1998  29.0     1.0        90418.0
1912         1999  36.0     1.0       126375.0
1913         2000  35.0     1.0        32476.0

[1914 rows x 4 columns]

In [7]:
pd.read_sql("SELECT * FROM transaction", engine)

        id  customer_id  purchase_amount purchase_date
0        1            1           986.86    2023-11-22
1        2            1          1102.69    2024-03-19
2        3            1           428.70    2023-11-05
3        4            1           261.08    2024-04-28
4        5            1          1247.51    2023-10-23
...    ...          ...              ...           ...
9800  9801         2000           670.05    2023-11-01
9801  9802         2000           477.60    2023-09-24
9802  9803         2000            33.09    2024-01-21
9803  9804         2000           618.88    2024-02-14
9804  9805         2000           428.70    2023-09-24

[9805 rows x 4 columns]